Tekla Open API Reference for Tekla Structures 2025
BasePoint.IsScopedCurrentBasePoint Property
 Gets the value indicating whether this base point is the scoped current base point. That means, a temporary base point set with the SetAsCurrent method, and changed back when returned token is disposed of.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsScopedCurrentBasePoint { get; }
Public ReadOnly Property IsScopedCurrentBasePoint As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace